第二轮测试截图/ELEC01-广州电力/广州电力缴费抹帐-460246/电力抹帐测试数据.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://gdeupsb.service.bankcomm.com/basic/atomic/operation.GDEUPSGdEleService/Schema" xmlns:gsp="http://gsp.bankcomm.com" xmlns:bbip="http://bbip.bankcomm.com">
   <soapenv:Body>
      <sch:eleaBnkPayFeeCancle>
         <gsp:requestInformation>
            <gsp:traceNo>2004440330150312180000000002</gsp:traceNo>
            <gsp:version>0.01</gsp:version>
            <gsp:traceSrc>HPFS0036</gsp:traceSrc>
         </gsp:requestInformation>
         <sch:request>
            <sch:requestHeader>
               <bbip:bbipRequestHead>
                  <bbip:txnCde>001</bbip:txnCde>
                  <bbip:chn>00</bbip:chn>
                  <!--Optional:-->
                  <bbip:reqSysCde></bbip:reqSysCde>
                  <!--Optional:-->
                  <bbip:subSysCde></bbip:subSysCde>
                  <!--Optional:-->
                  <bbip:bbipBusCde></bbip:bbipBusCde>
                  <bbip:reqJrnNo>2004440320150312150000000001</bbip:reqJrnNo>
                  <bbip:tlr>ABIR148</bbip:tlr>
                  <bbip:br>01441131999</bbip:br>
                  <bbip:bk>01441999999</bbip:bk>
                  <!--Optional:-->
                  <bbip:tlrTmlId>1</bbip:tlrTmlId>
                  <!--Optional:-->
                  <bbip:reqTyp></bbip:reqTyp>
                  <!--Optional:-->
                  <bbip:authLvl>01</bbip:authLvl>
                  <!--Optional:-->
                  <bbip:sup1Id></bbip:sup1Id>
                  <!--Optional:-->
                  <bbip:sup1Auth></bbip:sup1Auth>
                  <!--Optional:-->
                  <bbip:sup2Id></bbip:sup2Id>
                  <!--Optional:-->
                  <bbip:sup2Auth></bbip:sup2Auth>
                  <!--Optional:-->
                  <bbip:authLog></bbip:authLog>
                  <!--Optional:-->
                  <bbip:filler>?</bbip:filler>
                  <bbip:reqTme>2015-03-12T15:06:40</bbip:reqTme>
               </bbip:bbipRequestHead>
            </sch:requestHeader>
            <sch:eupsBusTyp>ELEC01</sch:eupsBusTyp>
            <sch:oldMfmVchNo>ABIR148000000010</sch:oldMfmVchNo>
            <!--Optional:-->
            <sch:dptTyp>0001</sch:dptTyp>
         </sch:request>
      </sch:eleaBnkPayFeeCancle>
   </soapenv:Body>
</soapenv:Envelope>