第二轮测试截图/ELEC01-广州电力/广州电力缴费-460245/电力缴费测试数据.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://gdeupsb.service.bankcomm.com/basic/atomic/operation.GDEUPSGdEleService/Schema" xmlns:gsp="http://gsp.bankcomm.com" xmlns:bbip="http://bbip.bankcomm.com">
   <soapenv:Body>
      <sch:eleaBnkPayFee>
         <gsp:requestInformation>
            <gsp:traceNo>2004440330150312080000000002</gsp:traceNo>
            <gsp:version>0.01</gsp:version>
            <!--Optional:-->
            <gsp:traceSrc>HPFS0036</gsp:traceSrc>
         </gsp:requestInformation>
         <sch:request>
            <sch:requestHeader>
               <bbip:bbipRequestHead>
                  <bbip:txnCde>001</bbip:txnCde>
                  <bbip:chn>00</bbip:chn>
                  <!--Optional:-->
                  <bbip:reqSysCde></bbip:reqSysCde>
                  <!--Optional:-->
                  <bbip:subSysCde></bbip:subSysCde>
                  <!--Optional:-->
                  <bbip:bbipBusCde></bbip:bbipBusCde>
                  <bbip:reqJrnNo>2004440320150312144400000002</bbip:reqJrnNo>
                  <bbip:tlr>ABIR148</bbip:tlr>
                  <bbip:br>01441131999</bbip:br>
                  <bbip:bk>01441999999</bbip:bk>
                  <!--Optional:-->
                  <bbip:tlrTmlId>1</bbip:tlrTmlId>
                  <bbip:filler></bbip:filler>
                  <bbip:reqTme>2015-03-09T15:06:40</bbip:reqTme>
               </bbip:bbipRequestHead>
            </sch:requestHeader>
            <sch:eupsBusTyp>ELEC01</sch:eupsBusTyp>
            <!--Optional:-->
            <sch:cusAc>6222600710008248926</sch:cusAc>
            <sch:thdCusNo>dark</sch:thdCusNo>
            <!--Optional:-->
            <sch:cusNme>ÕÅÈý</sch:cusNme>
            <!--Optional:-->
            <sch:lChkTm>20150399</sch:lChkTm>
            <!--Optional:-->
            <sch:dptTyp>0001</sch:dptTyp>
            <sch:txnAmt>0.01</sch:txnAmt>
            <!--Optional:-->
            <sch:fee>0.00</sch:fee>
            <!--Optional:-->
            <sch:vchTyp>000</sch:vchTyp>
            <!--Optional:-->
            <sch:vchNo></sch:vchNo>
            <!--Optional:-->
            <sch:bilDte>20150110</sch:bilDte>
            <!--Optional:-->
            <sch:password>111111</sch:password>
         </sch:request>
      </sch:eleaBnkPayFee>
   </soapenv:Body>
</soapenv:Envelope>